#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
module.gcp-basic.module.gcp-basic.data.google_client_openid_userinfo.me: Reading...
module.gcp-basic.module.gcp-basic.data.google_client_config.current: Reading...
module.gcp-basic.module.gcp-basic.data.google_client_config.current: Read complete after 0s [id=projects/"fe-dev-sandbox"/regions/"us-central1"/zones/<null>]
module.gcp-basic.module.gcp-basic.data.google_client_openid_userinfo.me: Read complete after 0s [id=sa-sat-testing-github-actions@fe-dev-sandbox.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcp-basic.module.gcp-basic.databricks_mws_workspaces.databricks_workspace will be created
  + resource "databricks_mws_workspaces" "databricks_workspace" {
      + account_id               = (sensitive value)
      + cloud                    = (known after apply)
      + creation_time            = (known after apply)
      + deployment_name          = "sat-gcp-lab"
      + gcp_workspace_sa         = (known after apply)
      + id                       = (known after apply)
      + is_no_public_ip_enabled  = true
      + location                 = "us-central1"
      + pricing_tier             = (known after apply)
      + workspace_id             = (known after apply)
      + workspace_name           = "sat-gcp-lab-workspace"
      + workspace_status         = (known after apply)
      + workspace_status_message = (known after apply)
      + workspace_url            = (known after apply)

      + cloud_resource_container {
          + gcp {
              + project_id = "fe-dev-sandbox"
            }
        }
    }

  # module.gcp-basic.module.gcp-unity-catalog.databricks_metastore.this will be created
  + resource "databricks_metastore" "this" {
      + cloud               = (known after apply)
      + created_at          = (known after apply)
      + created_by          = (known after apply)
      + force_destroy       = true
      + global_metastore_id = (known after apply)
      + id                  = (known after apply)
      + metastore_id        = (known after apply)
      + name                = "sat-gcp-lab-metastore"
      + owner               = "sat_deploy_testing_group"
      + region              = "us-central1"
      + storage_root        = (known after apply)
      + updated_at          = (known after apply)
      + updated_by          = (known after apply)
    }

  # module.gcp-basic.module.gcp-unity-catalog.databricks_metastore_assignment.this will be created
  + resource "databricks_metastore_assignment" "this" {
      + default_catalog_name = "main"
      + id                   = (known after apply)
      + metastore_id         = (known after apply)
      + workspace_id         = (known after apply)
    }

  # module.gcp-basic.module.gcp-unity-catalog.google_storage_bucket.unity_metastore will be created
  + resource "google_storage_bucket" "unity_metastore" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "sat-gcp-lab-bucket"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.gcp-basic.module.gcp-unity-catalog.google_storage_bucket_iam_member.unity_sa_admin will be created
  + resource "google_storage_bucket_iam_member" "unity_sa_admin" {
      + bucket = "sat-gcp-lab-bucket"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:ws-provision-tf-sa@fe-dev-sandbox.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.gcp-basic.module.gcp-unity-catalog.google_storage_bucket_iam_member.unity_sa_reader will be created
  + resource "google_storage_bucket_iam_member" "unity_sa_reader" {
      + bucket = "sat-gcp-lab-bucket"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:ws-provision-tf-sa@fe-dev-sandbox.iam.gserviceaccount.com"
      + role   = "roles/storage.legacyBucketReader"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + databricks_host = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @jgarciaf106, Action: `pull_request`*